---
kind: type
id: T:Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionGeneralH
source: html/512d0768-c2d3-f601-fd3e-c1db53d68f27.htm
---
# Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionGeneralH

Defines parameters for Rectangular Pipe structural section.

## Syntax (C#)
```csharp
public class StructuralSectionGeneralH : StructuralSectionRectangular
```